Tekla.Structures.Model.History.ModificationInfo
Modification info returned by History.

Tekla.Structures.Model.History.ModificationInfo.Modified
List of objects which have been modified or created. Objects which have only attribute (UDA) changed, and/or which has been numbered since last take are excluded.

Tekla.Structures.Model.History.ModificationInfo.Deleted
List of objects which have been deleted

Tekla.Structures.Model.History.ModificationInfo.ModifiedWithInfo
The modified objects with information of modification type. Objects which have only attribute (UDA) changed, and/or which has been numbered since last take are included.